# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    # [out_size, kernel_size, stride, af, se]
    [-1, 1, Conv, [24, 3, 2, 1]], # 0
    [-1, 1, DepthSeparableConv, [24, 3, 1, nn.ReLU, None]], # 1-P1/2
    # [expand_size, out_size, kernel_size, stride, af, se]
    [-1, 1, InvertedResidualBlock, [ 72,  36, 3, 2, nn.ReLU, None]], # 2
    [-1, 1, InvertedResidualBlock, [108,  36, 3, 1, nn.ReLU, None]], # 3
    [-1, 1, InvertedResidualBlock, [108,  36, 3, 1, nn.ReLU, None]], # 4
    [-1, 1, InvertedResidualBlock, [108,  36, 3, 1, nn.ReLU, None]], # 5-P2/4
    [-1, 1, InvertedResidualBlock, [108,  60, 5, 2, nn.ReLU, SeModule]], # 6
    [-1, 1, InvertedResidualBlock, [180,  60, 5, 1, nn.ReLU, SeModule]], # 7
    [-1, 1, InvertedResidualBlock, [180,  60, 5, 1, nn.ReLU, SeModule]], # 8-P3/8
    [-1, 1, InvertedResidualBlock, [240,  80, 3, 2,  hswish, None]], # 9
    [-1, 1, InvertedResidualBlock, [200,  80, 3, 1,  hswish, None]], # 10
    [-1, 1, InvertedResidualBlock, [184,  80, 3, 1,  hswish, None]], # 11
    [-1, 1, InvertedResidualBlock, [184,  80, 3, 1,  hswish, None]], # 12
    [-1, 1, InvertedResidualBlock, [480, 112, 3, 1,  hswish, SeModule]], # 13
    [-1, 1, InvertedResidualBlock, [672, 112, 3, 1,  hswish, SeModule]], # 14-P4/16
    [-1, 1, InvertedResidualBlock, [672, 160, 5, 2,  hswish, SeModule]], # 15
    [-1, 1, InvertedResidualBlock, [960, 160, 5, 1,  hswish, SeModule]], # 16
    [-1, 1, InvertedResidualBlock, [960, 160, 5, 1,  hswish, SeModule]], # 17-P5/32
#    [-1, 1, InvertedResidualBlock, [960, 160, 5, 2,  hswish, SeModule]], # 18
#    [-1, 1, InvertedResidualBlock, [960, 160, 5, 1,  hswish, SeModule]], # 19-P6/64
  ]

# YOLOv5 v6.0 head
head: [
    # FPN ADD
#    [-1, 1, Conv, [256, 1, 1]], # 20 P6/64
#
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 21
#    [17, 1, Conv, [256, 1, 1]], # 22
#    [[-1, 21], 1, Add, []], # 23 P5/32
#
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 24
#    [14, 1, Conv, [256, 1, 1]], # 25
#    [[-1, 24], 1, Add, []], # 26 P4/16
#
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 27
#    [ 8, 1, Conv, [256, 1, 1]], # 28
#    [[-1, 27], 1, Add, []], # 29 P3/8
#
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 30
#    [ 5, 1, Conv, [256, 1, 1]], # 31
#    [[-1, 30], 1, Add, []], # 32 P2/4
#
#    [32, 1, Conv, [256, 3, 1, 1]], # 33
#    [29, 1, Conv, [256, 3, 1, 1]], # 34
#    [26, 1, Conv, [256, 3, 1, 1]], # 35
#    [23, 1, Conv, [256, 3, 1, 1]], # 36
#
#    [[33, 34, 35, 36], 1, Segment, [nc, anchors, 32, 256]], # Detect(P3, P4, P5)
    [ -1, 1, Conv, [ 112, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ],
    [ [ -1, 14 ], 1, Concat, [ 1 ] ], # cat backbone P4
    [ -1, 3, C3, [ 112, False ] ], # 13

    [ -1, 1, Conv, [ 60, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ],
    [ [ -1, 8 ], 1, Concat, [ 1 ] ], # cat backbone P3
    [ -1, 3, C3, [ 60, False ] ], # 17 (P3/8-small)

    [ -1, 1, Conv, [ 60, 3, 2 ] ],
    [ [ -1, 22 ], 1, Concat, [ 1 ] ], # cat head P4
    [ -1, 3, C3, [ 112, False ] ], # 20 (P4/16-medium)

    [ -1, 1, Conv, [ 112, 3, 2 ] ],
    [ [ -1, 18 ], 1, Concat, [ 1 ] ], # cat head P5
    [ -1, 3, C3, [ 512, False ] ], # 23 (P5/32-large)

    [ [ 25, 28, 31 ], 1, Segment, [ nc, anchors, 32, 256 ] ], # Detect(P3, P4, P5)
  ]
